Extensions/ИнтеграцияGreenApi/Catalogs/iga_ЭтапыСценария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ЭтапыСценария</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередОбработкойЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеОбработкиЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыТекстаЭтапа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПосле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_КомандыОбработкиОтвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующийЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПослеОбработкиКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверочныйКодПосле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПроизвольногоТекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ЭтапыСценария/Forms/ФормаСценариев/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьСхему(Команда)
	ОбновитьСхемуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСхемуНаСервере()
	
	МакетHTML = Справочники.iga_ЭтапыСценария.ПолучитьМакет("МакетСхемыHTML"); 
	МакетБиблиотеки = Справочники.iga_ЭтапыСценария.ПолучитьМакет("МакетVisJS"); 
	
	ТекстШаблона = МакетHTML.ПолучитьТекст();
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "[ССЫЛКА_НА_БИБЛИОТЕКУ_VIS]", ПоместитьВоВременноеХранилище(МакетБиблиотеки, УникальныйИдентификатор));
	
	// 1. Получаем абсолютно все этапы ОДНИМ запросом в таблицу значений
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	iga_ЭтапыСценария.Ссылка КАК Ссылка,
		|	iga_ЭтапыСценария.Наименование КАК Наименование,
		|	iga_ЭтапыСценария.ВариантыОтветов.(
		|		Команда.Наименование КАК ВариантОтвета,
		|		СледующийЭтап КАК СледующийЭтап
		|	) КАК ВариантыОтветов
		|ИЗ
		|	Справочник.iga_ЭтапыСценария КАК iga_ЭтапыСценария
		|ГДЕ
		|	НЕ iga_ЭтапыСценария.ПометкаУдаления";
		
	ТаблицаВсехЭтапов = Запрос.Выполнить().Выгрузить();
	
	// 2. Кэшируем данные в Соответствие для мгновенного поиска по Ссылке
	КэшЭтапов = Новый Соответствие;
	Для Каждого СтрокаЭтапа Из ТаблицаВсехЭтапов Цикл
		КэшЭтапов.Вставить(СтрокаЭтапа.Ссылка, СтрокаЭтапа);
	КонецЦикла;
	
	// 3. Подготавливаем структуры для графа
	МассивУзлов = Новый Массив;
	МассивСвязей = Новый Массив;
	ПосещенныеЭтапы = Новый Соответствие; // Журнал для защиты от бесконечных циклов
	
	// 4. ЗАПУСКАЕМ ОБХОД
	Если ЗначениеЗаполнено(ВыбранныйЭтап) Тогда
		// Отрисовываем только ветку от выбранного этапа
		ОбойтиВетку(ВыбранныйЭтап, КэшЭтапов, МассивУзлов, МассивСвязей, ПосещенныеЭтапы);
	Иначе
		// Если этап не выбран, обходим все этапы (старое поведение)
		Для Каждого ЭлементКэша Из КэшЭтапов Цикл
			ОбойтиВетку(ЭлементКэша.Ключ, КэшЭтапов, МассивУзлов, МассивСвязей, ПосещенныеЭтапы);
		КонецЦикла;
	КонецЕсли;
	
	// 5. ФОРМИРУЕМ JSON
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("nodes", МассивУзлов);
	СтруктураДанных.Вставить("edges", МассивСвязей);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	ИтоговыйHTML = СтрЗаменить(ТекстШаблона, "[ДАННЫЕ_ГРАФА]", СтрокаJSON);
	ЭтаФорма.ТекстHTML = ИтоговыйHTML;
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиВетку(СсылкаНаЭтап, КэшЭтапов, МассивУзлов, МассивСвязей, ПосещенныеЭтапы)
	
	// БАЗОВАЯ ЗАЩИТА: Если мы здесь уже были, прерываем рекурсию!
	Если ПосещенныеЭтапы.Получить(СсылкаНаЭтап) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Достаем данные этапа из кэша (чтобы не делать запросы к БД)
	СтрокаДанных = КэшЭтапов.Получить(СсылкаНаЭтап);
	Если СтрокаДанных = Неопределено Тогда
		Возврат; // Защита от битых ссылок (если указан удаленный этап)
	КонецЕсли;
	
	// Отмечаем этап как посещенный
	ПосещенныеЭтапы.Вставить(СсылкаНаЭтап, Истина);
	
	УИД_Этапа = Строка(СсылкаНаЭтап.УникальныйИдентификатор());
	
	// --- СОЗДАЕМ БЛОК ЭТАПА ---
	УзелЭтапа = Новый Структура("id, label, group", УИД_Этапа, СтрокаДанных.Наименование, "stages");
	
	// Красивая фишка: выделим зелёным цветом тот этап, с которого мы начали поиск
	Если ВыбранныйЭтап = СсылкаНаЭтап Тогда
		ЦветСтарта = Новый Структура("background, border", "#A2D9CE", "#1E8449"); 
		УзелЭтапа.Вставить("color", ЦветСтарта);
	КонецЕсли;
	
	МассивУзлов.Добавить(УзелЭтапа);
	
	// --- ОБРАБАТЫВАЕМ ВАРИАНТЫ ОТВЕТОВ ---
	СчетчикКнопок = 0;
	Для Каждого СтрокаОтвета Из СтрокаДанных.ВариантыОтветов Цикл
		СчетчикКнопок = СчетчикКнопок + 1;
		УИД_Кнопки = УИД_Этапа + "_btn" + СчетчикКнопок; 
		
		// Создаем блок кнопки
		УзелКнопки = Новый Структура("id, label, group", УИД_Кнопки, СтрокаОтвета.ВариантОтвета, "buttons");
		МассивУзлов.Добавить(УзелКнопки);
		
		// Связь 1: От Этапа к Кнопке
		МассивСвязей.Добавить(Новый Структура("from, to", УИД_Этапа, УИД_Кнопки));
		
		// Связь 2: От Кнопки к Следующему этапу
		Если ЗначениеЗаполнено(СтрокаОтвета.СледующийЭтап) Тогда
			
			УИД_Следующего = Строка(СтрокаОтвета.СледующийЭтап.УникальныйИдентификатор());
			МассивСвязей.Добавить(Новый Структура("from, to", УИД_Кнопки, УИД_Следующего));
			
			// МАГИЯ РЕКУРСИИ: Проваливаемся в следующий этап
			ОбойтиВетку(СтрокаОтвета.СледующийЭтап, КэшЭтапов, МассивУзлов, МассивСвязей, ПосещенныеЭтапы);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуЭтапа(ГУИД)
	
	Возврат Справочники.iga_ЭтапыСценария.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	
КонецФункции

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// Заголовок — это строка, которую мы отправили из JS: "v8:open_stage:GUID:TIMESTAMP"
	Префикс = "v8:open_stage:";
	
	ЗаголовокДокумента = ДанныеСобытия.Document.title;
	
	Если СтрНачинаетсяС(ЗаголовокДокумента, Префикс) Тогда
		
		// 1. Убираем префикс
		ДанныеКоманды = СтрЗаменить(ЗаголовокДокумента, Префикс, "");
		
		// 2. Разрезаем строку, чтобы забрать только GUID (первая часть до двоеточия)
		Части = СтрРазделить(ДанныеКоманды, ":");
		Если Части.Количество() > 0 Тогда
			ГуидСтрокой = Части[0];
			
			// 3. Открываем карточку
			
			ОткрытьФорму("Справочник.iga_ЭтапыСценария.Форма.ФормаЭлемента", 
				Новый Структура("Ключ", ПолучитьСсылкуЭтапа(ГуидСтрокой)), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеСобытия.Document.title = "";
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВыбранныйЭтап", ВыбранныйЭтап);

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСхемуНаСервере();

КонецПроцедуры
